#include "nautilus/spinlock.h"
#include <nautilus/nautilus.h>
#include <nautilus/cpu.h>
#include <nautilus/mm.h>
#include <nautilus/irq.h>
#include <nautilus/dev.h>
#include <nautilus/blkdev.h>
#include <nautilus/naut_string.h>
#include <nautilus/timer.h>
#include <nautilus/condvar.h>

#include <dev/pci.h>
#include <dev/ahci.h>

#ifndef NAUT_CONFIG_DEBUG_AHCI
#undef  DEBUG_PRINT
#define DEBUG_PRINT(fmt, args...) 
#endif

#define ERROR(fmt, args...) ERROR_PRINT("ahci: " fmt, ##args)
#define DEBUG(fmt, args...) DEBUG_PRINT("ahci: " fmt, ##args)
#define INFO(fmt, args...)  INFO_PRINT("ahci: " fmt, ##args)

#define LOCK_CONF          uint8_t _state_lock_flags
#define LOCK_ACQUIRE(lock) _state_lock_flags = spin_lock_irq_save(&(lock))
#define LOCK_RELEASE(lock) spin_unlock_irq_restore(&(lock), _state_lock_flags)

#define ATOMIC_LOAD(srcptr)          __atomic_load_n(srcptr, __ATOMIC_SEQ_CST)
#define ATOMIC_STORE(destptr, value) __atomic_store_n(destptr, value, __ATOMIC_SEQ_CST)

#define PCI_INTEL_VENDOR_ID     0x8086  // intel
#define PCI_ICH9_DEVICE_ID      0x2922  // ICH9
#define PCI_CONTROLLER_CLASS    0x01    // mass storage device
#define PCI_CONTROLLER_SUBCLASS 0x06    // serial ATA
#define PCI_HEADER_TYPE         0x0     // endpoint

#define ATA_BLKSIZE 512

#define HBA_MAX_PORTS 32

#define FIS_MAX_NBLKS 65536

#define CMD_LIST_NSLOTS  32
#define CMD_TBL_MAX_NPRD 65535

#define PRDT_MAX_LEN   (8 * 1024)
#define PRDT_MAX_NBLKS (PRDT_MAX_LEN / ATA_BLKSIZE)

#define ATA_CFG_CMD_IRQ_DISABLE (1 << 10)
#define ATA_CFG_CMD_BUSMASTER   (1 << 2)
#define ATA_CFG_CMD_MEMSPACE    (1 << 1)
#define ATA_CFG_CMD_IOSPACE      1

#define HBA_GHC_AHCI_ENABLE (1 << 31)
#define HBA_GHC_IRQ_ENABLE  (1 << 1)
#define HBA_GHC_RESET        1

#define PORT_CMD_RUNNING (1 << 15)
#define PORT_CMD_FIS     (1 << 4)
#define PORT_CMD_START    1

#define PORT_IS_TF_ERR    (1 << 30)
#define PORT_IS_PRD       (1 << 5)
#define PORT_IS_DMA_SETUP (1 << 2)
#define PORT_IS_PIO_SETUP (1 << 1)
#define PORT_IS_D2H        1

#define PORT_IE_TF_ERR        (1 << 30)
#define PORT_IE_OVERFLOW      (1 << 24)
#define PORT_IE_PRD_PROCESSED (1 << 5)
#define PORT_IE_DMA_SETUP     (1 << 2)
#define PORT_IE_PIO_SETUP     (1 << 1)
#define PORT_IE_D2H            1

#define PORT_TFD_BUSY 0x80
#define PORT_TFD_DRQ  0x08

#define PORT_SSTS_DET_DETECTED 3
#define PORT_SSTS_IPM_ACTIVE   1

#define FIS_DEVICE_LBAMODE (1 << 6)

typedef enum {
  ATA_CMD_IDENTIFY_DMA  = 0xEE,
  ATA_CMD_IDENTIFY_PIO  = 0xEC,
  ATA_CMD_READ_DMA_EXT  = 0x25,
  ATA_CMD_WRITE_DMA_EXT = 0x35,
} ata_cmd_t;

typedef enum {
  SATA_SIG_ATA   = 0x00000101,  // SATA drive
  SATA_SIG_ATAPI = 0xEB140101,  // SATAPI drive
  SATA_SIG_SEMB  = 0xC33C0101,  // Enclosure management bridge
  SATA_SIG_PM    = 0x96690101,  // Port multiplier
} sata_sig_t;

typedef enum {
  FIS_TYPE_REG_H2D   = 0x27,  // Register FIS - host to device
  FIS_TYPE_REG_D2H   = 0x34,  // Register FIS - device to host
  FIS_TYPE_DMA_ACT   = 0x39,  // DMA activate FIS - device to host
  FIS_TYPE_DMA_SETUP = 0x41,  // DMA setup FIS - bidirectional
  FIS_TYPE_DATA      = 0x46,  // Data FIS - bidirectional
  FIS_TYPE_BIST      = 0x58,  // BIST activate FIS - bidirectional
  FIS_TYPE_PIO_SETUP = 0x5F,  // PIO setup FIS - device to host
  FIS_TYPE_DEV_BITS	 = 0xA1,	// Set device bits FIS - device to host
} fis_type_t;

typedef enum {
  AHCI_DEV_NULL   = 0,
  AHCI_DEV_SATA   = 1,
  AHCI_DEV_SEMB   = 2,
  AHCI_DEV_PM     = 3,
  AHCI_DEV_SATAPI = 4,
} ahci_dev_t;

typedef struct {
  // DWORD 0
  uint8_t fis_type;	// FIS_TYPE_REG_H2D
 
  uint8_t pmport:4;	// Port multiplier
  uint8_t rsv0:3;		// Reserved
  uint8_t c:1;		  // 1: Command, 0: Control
 
  uint8_t command;	// Command register
  uint8_t featurel;	// Feature register, 7:0
 
  // DWORD 1
  uint8_t lba0;	 	  // LBA low register, 7:0
  uint8_t lba1;	 	  // LBA mid register, 15:8
  uint8_t lba2;	 	  // LBA high register, 23:16
  uint8_t device;   // Device register
 
  // DWORD 2
  uint8_t lba3;		  // LBA register, 31:24
  uint8_t lba4;		  // LBA register, 39:32
  uint8_t lba5;		  // LBA register, 47:40
  uint8_t featureh; // Feature register, 15:8
 
  // DWORD 3
  union {
    uint16_t count; // Count register, 7:15
    struct {
      uint8_t count_l; // Count low
      uint8_t count_h; // Count high
    } __attribute__((packed));
  };
  uint8_t icc;		  // Isochronous command completion
  uint8_t control;	// Control register
 
  // DWORD 4
  uint8_t rsv1[4];	// Reserved
} __attribute__((packed)) fis_h2d_t;

typedef volatile struct {
  // DWORD 0
  uint8_t fis_type;    // FIS_TYPE_REG_D2H
 
  uint8_t pmport:4;    // Port multiplier
  uint8_t rsv0:2;      // Reserved
  uint8_t i:1;         // Interrupt bit
  uint8_t rsv1:1;      // Reserved
 
  union {
    uint8_t val;
    struct {
      uint8_t err:1;  // error occurred
      uint8_t rsv:2; 
      uint8_t drq:1;  // drive has data ready or can accept data (PIO)
      uint8_t srv:1;  // overlapped mode?
      uint8_t df:1;   // drive fault
      uint8_t rdy:1;  // drive ready
      uint8_t bsy:1;  // drive busy
    } __attribute__((packed));
  } status;            // Status register

  uint8_t error;       // Error register
 
  // DWORD 1
  uint8_t lba0;        // LBA low register, 7:0
  uint8_t lba1;        // LBA mid register, 15:8
  uint8_t lba2;        // LBA high register, 23:16
  uint8_t device;      // Device register
 
  // DWORD 2
  uint8_t lba3;        // LBA register, 31:24
  uint8_t lba4;        // LBA register, 39:32
  uint8_t lba5;        // LBA register, 47:40
  uint8_t rsv2;        // Reserved
 
  // DWORD 3
  uint8_t countl;      // Count register, 7:0
  uint8_t counth;      // Count register, 15:8
  uint8_t rsv3[2];     // Reserved
 
  // DWORD 4
  uint8_t  rsv4[4];     // Reserved
} __attribute__((packed)) fis_d2h_t;

typedef volatile struct {
  // DWORD 0
  uint8_t fis_type;	// FIS_TYPE_PIO_SETUP
 
  uint8_t pmport:4;	// Port multiplier
  uint8_t rsv0:1;		// Reserved
  uint8_t d:1;		// Data transfer direction, 1 - device to host
  uint8_t i:1;		// Interrupt bit
  uint8_t rsv1:1;
 
  uint8_t status;		// Status register
  uint8_t error;		// Error register
 
  // DWORD 1
  uint8_t lba0;		// LBA low register, 7:0
  uint8_t lba1;		// LBA mid register, 15:8
  uint8_t lba2;		// LBA high register, 23:16
  uint8_t device;		// Device register
 
  // DWORD 2
  uint8_t lba3;		// LBA register, 31:24
  uint8_t lba4;		// LBA register, 39:32
  uint8_t lba5;		// LBA register, 47:40
  uint8_t rsv2;		// Reserved
 
  // DWORD 3
  uint8_t countl;		// Count register, 7:0
  uint8_t counth;		// Count register, 15:8
  uint8_t rsv3;		// Reserved
  uint8_t e_status;	// New value of status register
 
  // DWORD 4
  uint16_t tc;		// Transfer count
  uint8_t rsv4[2];	// Reserved
} __attribute__((packed)) fis_pio_setup_t;;

typedef volatile struct {
  // DWORD 0
  uint8_t fis_type;	      // FIS_TYPE_DMA_SETUP
 
  uint8_t pmport:4;	      // Port multiplier
  uint8_t rsv0:1;		      // Reserved
  uint8_t d:1;		        // Data transfer direction, 1 - device to host
  uint8_t i:1;		        // Interrupt bit
  uint8_t a:1;            // Auto-activate. Specifies if DMA Activate FIS is needed
 
  uint8_t rsv[2];         // Reserved
 
  //DWORD 1&2
  uint64_t dma_buf_id;    // DMA Buffer Identifier. Used to Identify DMA buffer in host memory.
                          // SATA Spec says host specific and not in Spec. Trying AHCI spec might work.

  //DWORD 3
  uint32_t rsv1;          // More reserved

  //DWORD 4
  uint32_t dma_buf_offset;  // Byte offset into buffer. First 2 bits must be 0

  //DWORD 5
  uint32_t tc;              // Number of bytes to transfer. Bit 0 must be 0

  //DWORD 6
  uint32_t rsv2;          // Reserved
} __attribute__((packed)) fis_dma_setup_t;

typedef volatile struct{
  // 0x00
  fis_dma_setup_t dsfis; // DMA setup FIS
  uint8_t pad0[4];
 
  // 0x20
  fis_pio_setup_t psfis; // PIO setup FIS
  uint8_t pad1[12];
 
  // 0x40
  fis_d2h_t rfis;        // D2H register FIS
  uint8_t pad2[4];
 
  // 0x58
  uint8_t sdbfis[8];		 // Set device bit FIS
 
  // 0x60
  uint8_t ufis[64];      // Unknown FIS
 
  // 0xA0
  uint8_t rsv[0x100-0xA0];
} __attribute__((packed, aligned(256))) fis_hba_t;

typedef struct {
  union {
    volatile void *dba;
    struct {
      uint32_t dba_l;		   // Data base address lower 32 bits
      uint32_t dba_u;		   // Data base address upper 32 bits
    } __attribute__((packed));
  };                 // Data base address
  uint32_t rsv0;		 // Reserved

  uint32_t dbc:22;	 // Byte count, 4M max
  uint32_t rsv1:9;	 // Reserved
  uint32_t i:1;		   // Interrupt on completion
} __attribute__((packed)) prd_t;

typedef struct {
  // 0x00
  uint8_t cfis[64];    // Command FIS

  // 0x40
  uint8_t acmd[16];    // ATAPI command
  
  // 0x50
  uint8_t rsv[48];	   // Reserved

  // 0x80
  prd_t prdt[CMD_TBL_MAX_NPRD];  // Physical region descriptor table entries, 0 ~ 65535
} __attribute__((packed, aligned(128))) cmd_table_t;

typedef struct {
  // DW0
  uint8_t  cfl:5;	  // Command FIS length in DWORDS, 2 ~ 16
  uint8_t  a:1;		  // ATAPI
  uint8_t  w:1;		  // Write, 1: H2D, 0: D2H
  uint8_t  p:1;		  // Prefetchable
  uint8_t  r:1;		  // Reset
  uint8_t  b:1;		  // BIST
  uint8_t  c:1;		  // Clear busy upon R_OK
  uint8_t  rsv0:1;  // Reserved
  uint8_t  pmp:4;		// Port multiplier port

  uint16_t prdtl;		// Physical region descriptor table length in entries

  // DW1
  volatile uint32_t prdbc;		// Physical region descriptor byte count transferred

  // DW2, 3
  union {
    cmd_table_t *ctba;
    struct {
      uint32_t ctba_l;		// Command table descriptor base address
      uint32_t ctba_u;		// Command table descriptor base address upper 32 bits
    } __attribute__((packed));
  };

  // DW4 - 7
  uint32_t rsv1[4];	// Reserved
} __attribute__((packed)) cmd_hdr_t;

typedef struct {
  cmd_hdr_t cmds[CMD_LIST_NSLOTS];
} __attribute__((packed, aligned(1024))) cmd_list_t;

typedef volatile struct {
    union {
      cmd_list_t *clb;
      struct {
        uint32_t clb_l;  // 0x00, command list base address lower 32 bits, 1K-byte aligned
        uint32_t clb_u;  // 0x04, command list base address upper 32 bits
      } __attribute__((packed));
    };                         // command list base address 1 ~ 32

    union {
      fis_hba_t *fb;
      volatile struct {
        uint32_t fb_l; // 0x08, FIS base address lower 32 bits, 256-byte aligned
        uint32_t fb_u; // 0x0C, FIS base address upper 32 bits
      } __attribute__((packed));
    };                         // fis base address 

    volatile uint32_t is;      // 0x10, interrupt status  
    uint32_t ie;               // 0x14, interrupt enable
    
    union {
      uint32_t val;
      struct {
        uint8_t st    : 1;  // start
        uint8_t sud   : 1;  // spin-up device
        uint8_t pod   : 1;  // power on device
        uint8_t clo   : 1;  // command list override
        uint8_t fre   : 1;  // fis receive enable
        uint8_t rsvd  : 3;  // reserved
        uint8_t ccs   : 5;  // current command slot
        uint8_t mpss  : 1;  // mechanical presence switch state
        uint8_t fr    : 1;  // fis receive running
        uint8_t cr    : 1;  // command list running
        uint8_t cps   : 1;  // cold presence state
        uint8_t pma   : 1;  // port multiplier attached
        uint8_t hpcp  : 1;  // hot plug capable port
        uint8_t mpsp  : 1;  // mechanical presence switch attached to port
        uint8_t cpd   : 1;  // cold presence detection
        uint8_t esp   : 1;  // external sata port
        uint8_t fbscp : 1;  // fis-based switching capable port
        uint8_t apste : 1;  // automatic partial to slumber transitions enabled
        uint8_t atapi : 1;  // device is atapi
        uint8_t dlae  : 1;  // drive led on atapi enable
        uint8_t alpe  : 1;  // aggressive link power management enable
        uint8_t asp   : 1;  // aggressive slumber/partial 
        uint8_t icc   : 4;  // interface communication control 
      } __attribute__((packed));
    } cmd;		                 // 0x18, command and status
    
    uint32_t rsv0;		         // 0x1C, Reserved
    uint32_t tfd;		           // 0x20, task file data
    uint32_t sig;		           // 0x24, signature
    
    union {
      uint32_t val;
      struct {
        uint8_t det   : 4;    // Device detection
        uint8_t spd   : 4;    // Current interface speed
        uint8_t ipm   : 4;    // Interface power management
        uint32_t rsv  : 20;
      } __attribute__((packed));
    } ssts;                    // 0x28, SATA status (SCR0:SStatus)

    union {
      uint32_t val;
      struct {
        uint8_t det  : 4;   // device detection
        uint8_t spd  : 4;   // speed allowed
        uint8_t ipm  : 4;   // power management transitions allowed
        uint32_t rsv : 20;
      } __attribute__((packed));
    } sctl;                    // 0x2C, SATA control (SCR2:SControl)

    uint32_t serr;		         // 0x30, SATA error (SCR1:SError)
    uint32_t sact;		         // 0x34, SATA active (SCR3:SActive)
    uint32_t ci;		           // 0x38, command issue
    uint32_t sntf;		         // 0x3C, SATA notification (SCR4:SNotification)
    uint32_t fbs;		           // 0x40, FIS-based switch control
    uint32_t devslp;            // 0x44, Device Sleep
    uint32_t rsv1[10];	       // 0x47 - 0x6F, Reserved
    uint32_t vendor[4];	       // 0x70 ~ 0x7F, vendor specific
} __attribute__((packed)) hba_port_reg_t;

typedef volatile struct {
  // 0x00 - 0x2B, Generic Host Control
  union {
    uint32_t val;
    struct {
      uint8_t np    : 5;  // number of ports 
      uint8_t sxs   : 1;  // supports external SATA
      uint8_t ems   : 1;  // enclosure management supported
      uint8_t cccs  : 1;  // command completion coalescing supported
      uint8_t ncs   : 5;  // number of command slots
      uint8_t psc   : 1;  // partial state capable
      uint8_t ssc   : 1;  // slumber state capable
      uint8_t pmd   : 1;  // pio multiple drq block
      uint8_t fbss  : 1;  // fis-based switching supported
      uint8_t spm   : 1;  // supports port multiplier
      uint8_t sam   : 1;  // supports ahci mode only
      uint8_t rsv   : 1;  // reserved
      uint8_t iss   : 4;  // interface speed support
      uint8_t sclo  : 1;  // supports command list override
      uint8_t sal   : 1;  // supports activity led
      uint8_t salp  : 1;  // supports aggressive link power management
      uint8_t sss   : 1;  // supports staggered spin up
      uint8_t smps  : 1;  // supports mechanical presence switch
      uint8_t ssntf : 1;  // supports snotification register
      uint8_t sncq  : 1;  // supports native command queuing
      uint8_t s64a  : 1;  // supports 64 bit addressing
    } __attribute__((packed));
  } cap;                       // 0x00, Host Capability

  uint32_t ghc;                // 0x04, Global host control
  uint32_t is;                 // 0x08, Interrupt status
  uint32_t pi;		             // 0x0C, Port implemented
  uint32_t vs;		             // 0x10, Version
  uint32_t ccc_ctl;            // 0x14, Command completion coalescing control
  uint32_t ccc_pts;	           // 0x18, Command completion coalescing ports
  uint32_t em_loc;             // 0x1C, Enclosure management location
  uint32_t em_ctl;	           // 0x20, Enclosure management control
  uint32_t cap2;	             // 0x24, Host capabilities extended
  uint32_t bohc;		           // 0x28, BIOS/OS handoff control and status

  // 0x2C - 0x9F, Reserved
  uint8_t rsv[0xA0-0x2C];   
  
  // 0xA0 - 0xFF, Vendor specific registers 
  uint8_t vendor[0x100-0xA0];

  // 0x100 - 0x10FF, Port control registers 1 ~ 32 
  hba_port_reg_t ports[HBA_MAX_PORTS];
} __attribute__((packed)) hba_reg_t;

_Static_assert(sizeof(fis_hba_t)           == 0x100,  "bad fis_hba_t length");
_Static_assert(offsetof(fis_hba_t, dsfis)  == 0x00,   "bad dsfis offset in fis_hba_t");
_Static_assert(offsetof(fis_hba_t, psfis)  == 0x20,   "bad psfis offset in fis_hba_t");
_Static_assert(offsetof(fis_hba_t, rfis)   == 0x40,   "bad rfis offset in fis_hba_t");
_Static_assert(offsetof(fis_hba_t, sdbfis) == 0x58,   "bad sdbfis offset in fis_hba_t");
_Static_assert(offsetof(fis_hba_t, ufis)   == 0x60,   "bad ufis offset in fis_hba_t");
_Static_assert(sizeof(prd_t)               == 0x10,   "bad prd_t length\n");
